app/views/topics/show.html.erb

        <% if session["user_id"].present?%>
            <%if User.find_by(id: session["user_id"]).username == @topic.user%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]


    <% Comment.where(topic_id: @topic.id).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = 4  ORDER BY id content