app/controllers/connectors_controller.rb

INSERT INTO "tags" ("title") VALUES (?)  [["title", "hi"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."title" = ? LIMIT 1  [["title", "hi"]]
SELECT  1 AS one FROM "connectors" WHERE "connectors"."topic_id" = ? AND "connectors"."tag_id" = ? LIMIT 1  [["topic_id", 5], ["tag_id", 7]]
SELECT  1 AS one FROM "tags" WHERE "tags"."title" = 'hi' LIMIT 1
INSERT INTO "connectors" ("topic_id", "tag_id") VALUES (?, ?)  [["topic_id", 2], ["tag_id", 3]]
---
  def create
    Tag.create title: params[:title] #will only happen if doesnt exist already
    @tag = Tag.find_by(title: params[:title])


      con=Connector.new
      con.topic_id = params["topic_id"]
      con.tag_id = @tag.id
    if !Connector.exists?(topic_id: params["topic_id"], tag_id: @tag.id)
      con.save #only save if it doesnt exist already, otherwise just use it for redirect