app/controllers/subforums_controller.rb

  def index
    @subforums = Subforum.all.limit(1000)
---
SELECT  "subforums".* FROM "subforums" LIMIT 1000

  def show
    @subforum = Subforum.find(params[:id])
---
SELECT  "subforums".* FROM "subforums" WHERE "subforums"."id" = ? LIMIT 1  [["id", 1]]

  def create
    Subforum.create title: params[:title]
---
INSERT INTO "subforums" ("title") VALUES (?)  [["title", "ok"]]

  def edit
    @subforum = Subforum.find(params[:id])
---
SELECT  "subforums".* FROM "subforums" WHERE "subforums"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @subforum = Subforum.find(params[:id])
    @subforum.update title: params[:title]
---
SELECT  "subforums".* FROM "subforums" WHERE "subforums"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "subforums" SET "title" = ? WHERE "subforums"."id" = ?  [["title", "On The Fiel"], ["id", 1]]

  def destroy
    Subforum.delete(params[:id])
---
DELETE FROM "subforums" WHERE "subforums"."id" = ?  [["id", 2]]