app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" LIMIT 1000
---
  def index
    @tags = Tag.all.limit(1000)

INSERT INTO "tags" ("title") VALUES (?)  [["title", "dasasd"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."title" = ? LIMIT 1  [["title", "wao"]]
---
  def create
   Tag.create title: params[:title] #will only happen if doesnt exist already
   @tag = Tag.find(params[:title])