app/controllers/topics_controller.rb

INSERT INTO "topics" ("subforum_id", "content", "title", "user") VALUES (?, ?, ?, ?)  [["subforum_id", 1], ["content", "adsdasadsads"], ["title", "dsasaddas"], ["user", "Admin"]]
---
  def create
    # Topic.create title: params[:title],
    #     subforum_id: params[:subforum_id],
    #     content: params[:content]
    #
    # redirect_to topic_url(com.topic_id)

    top=Topic.new
    top.subforum_id = params["subforum_id"]
    Rails.logger.info top.subforum_id
    Rails.logger.info "hiiiiiiii"
    top.content=params["content"]
    Rails.logger.info top.content
    top.title=params["title"]
    top.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "topics" SET "title" = ?, "subforum_id" = ?, "content" = ? WHERE "topics"."id" = ?  [["title", "cxxczcx"], ["subforum_id", nil], ["content", "cxxccx"], ["id", 8]]
---
  def update
    @topic = Topic.find(params[:id])
    @topic.update title: params[:title],
        subforum_id: params[:subforum_id],
        content: params[:content]

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    @topic= Topic.find(params[:id])
    Topic.delete(params[:id])